/*
Пример 4: Програмата проверява дали въведено от потребителя число n е в предварително
зададен диапазон [-5; 20). Ако въведената стойност не е в диапазона, програмата кара
потребителя да въведе отново стойност.
Забележка: За да може първо потребителят да въведе стойност, а след това програмата да
провери дали тя е коректна, ще се използва цикъл с постусловие, който ще се повтаря, докато
въведената стойност е извън зададения диапазон.
*/

#include <stdio.h>

int main()
{
	float n;
	
	do
	{
		printf("Enter value in the range [-5; 20): ");
		scanf("%f", &n);
	} while (n < -5 || n >= 20);
	
	printf("You have entered a correct value - %f.", n);
	
	return 0;
}
