#include <stdio.h>

int main()
{
	int a; // целочислена променлива
	int *p1; // указател към цяло число
	int **p2; // двоен указател към цяло число
	
	p1 = &a; // свързване на указател p1 и променлива a
	p2 = &p1; // насочване на p2 към p1
	
	a = 100; // задаване на стойност 100 за променливата a
	
	// осъществяване на достъп до стойността на променливата a чрез указателите p1 и p2
	printf("\nValue of a (using p1): %d", *p1);
	printf("\nValue of a (using p2): %d", **p2);
	
	// промяна на стойността на променливата a чрез указател p1
	*p1 = 200;
	printf("\nValue of a: %d", *p1);
	
	// промяна на стойността на променливата a чрез указател p2	
	**p2 = 300;
	
	printf("\nValue of a: %d\n", **p2);


	return 0;
}
