/*
Пример 2: Вариант на програмата от Пример 1, но за условие за спиране на обработката се
използва въвеждане на специален символ – символ за край на файл (EOF). Символът за край
на файл се въвежда с Ctrl+Z. Извършено е и разширяване на примера с използване на условна
обработка – намира се сумата само на четните числа.
Забележка: В по-нови версии на Windows (например Windows 10) е необходимо Ctrl+Z да се
въведе 3 пъти с натискане на клавиш Enter, за да бъде прочетен символ за край на файл.
Функцията scanf връща резултат от тип int, който е броят на успешно прочетените стойности
или EOF при прочитане на символ за край на файл. Това може да се използва за указване на
край на обработката. За целта след прочитане на стойност трябва да се провери върнатият от
функцията scanf резултат. Така ако се въведе символ, а не число това ще бъде засечено и
програмата няма да спре да работи.
За да се намери сумата само на четните числа, се използва оператор if, с който да се провери
дали числото е четно и само тогава се добавя към сумата, иначе се пропуска.
*/

#include <stdio.h>

int main()
{
	int input;
	int sum, br;
	int res;
	sum = br = 0;
	
	printf("Enter value:");
	
	while((res = scanf("%d", &input)) != EOF)
	{
		if (!res)
		{
			getchar();
			printf("Enter value:");
			continue;
		}
		
		br++;
		
		if (input % 2 == 0)
		{
			sum += input;
		
		}
		
		printf("Enter value:");
	}
	
	printf("Sum of even numbers: %d\n", sum);
	printf("Value count: %d\n", br);
	
	return 0;
}

















