/*
Пример 3: Намиране на максимална стойност и нейния пореден номер в последователност от
въведени стойности при предварително известен общ брой стойности.
Първо трябва потребителят да въведе броя на елементите, които ще се обработят. За да се
следи броят на въведените елементи, е необходимо да се добави брояч, който да се
увеличава при всяко въвеждане на стойност.
За съхраняване на максимум е необходима допълнителна променлива. Тя се използва както
за текущ максимум, така и за крайния резултат. В началото тя се инициализира с първата
въведена стойност. След това при всяко завъртане на цикъла се проверява дали текущо
обработваната стойност е по-голяма от стойността в съответната променлива и ако да, тази
стойност се сменя с новия максимум.
За да се запази поредният номер, също е необходима допълнителна променлива. В началото
тя се инициализира с 1. При намиране на нов максимум, на променливата се присвоява
текущата стойност на брояча на въвежданите стойности.
*/

#include <stdio.h>
int main()
{
	float input;
	int cnt, k;
	float max;
	int max_num;
	
	printf("Enter count:");
	scanf("%d", &cnt);
	
	printf("Enter value:");
	scanf("%f", &input);
	
	max = input;
	max_num = k = 1;
	
	while (k < cnt)
	{
		printf("Enter value:");
		scanf("%f", &input);
		k++;
		
		if (input > max)
		{
			max = input;
			max_num = k;
		}
	}
	
	printf("Maximum is %.2f.\n", max);
	printf("Number is %d.\n", max_num);
	
	return 0;
}
