/*
Пример 1: Програмата намира сумата на поредица от въведени стойности. За край на
въвеждането се въвежда -999.
В началото се инициализира сумата, въвежда се първата стойност, следва цикъл, в който
докато въведената стойност е различна от -999, при всяко завъртане на цикъла текущата
стойност се добавя към сумата и се чете нова стойност. Накрая се извежда получената сума.
*/

#include <stdio.h>

int main()
{
	int input, sum;
	sum = 0;

	printf("Enter value:");
	scanf("%d", &input);
	
	while (input != -999)
	{
		sum += input;
		printf("Enter value:");
		scanf("%d", &input);
	}
	
	printf("The sum is: %d.\n", sum);
	
	return 0;
}
