/*
4. Напишете програма, която чете поредица от цели числа от клавиатурата. Програмата да
намира и отпечатва средноаритметичната стойност на числата от поредицата. Въвеждането
спира при въвеждане на стойност, равна на нула.
Забележка: Включете проверка дали броят на въведените числа в поредицата е по-голям от 0
преди да извършите делението за определяне на средноаритметичната стойност. Добавете
проверка на върнатия код от scanf(), за да сте сигурни, че потребителят е въвел числа.
*/

#include <stdio.h>

int main()
{
	int number = -1;
	float mean = 0;
	float sum = 0;
	int cnt = 0;
	int flag = 0;

	do {
		printf("Enter a number: \n");
		flag = scanf("%d", &number);
		
		if (flag)
		{
			cnt++;
			sum = sum + number;
		} else {
			getchar();
		}
		
	} while(number != 0);
	
	if(cnt)
	{
		mean = sum/cnt;
		
		printf("Mean = %f\n", mean);
	} else {
		printf("Division by zero!\n");
	}
	

	return 0;
}
