/*
Пример 4: Програма, която изчислява дължината и лицето на окръжност по въведен радиус
чрез потребителска функция. Функцията има три параметъра: радиусът на окръжността,
използван като обикновена променлива, дължината на окръжността като указател и лицето
на окръжността като указател. Всички параметри са числа от тип double.
*/

#include <stdio.h>

void calc(double r, double *c, double *a);

int main()
{
	double x, y, z;
	printf("r = "); scanf("%lf", &x);
	
	calc(x, &y, &z);
	
	printf("C = %.2lf A = %.2lf\n", y, z);
	printf("r = %.2lf\n", x);
	
	return 0;
}

void calc(double r, double *c, double *a)
{
	*c = 2 * 3.14 * r;
	*a = 3.14 * r * r;
	r++;
}
